# Data Generation Notebook

**This notebook generates sample data for Customer Lifetime Value (CLV) analysis**

#### Loading modules and packages
- Import modules and packages necessary for data generation.

#### Declaring Constants
- Define constants for the number of products, customers, and transactions.

#### Generating Customer Data
- Generate customer data using the `generate_customer` function and save it to a CSV file.

#### Generating Product Data
- Generate product data using the `generate_product` function and save it to a CSV file.

#### Generating Transaction Data
- Generate transaction data using the `generate_transaction` function and save it to a CSV file.

#### Generating Dates Data
- Generate date data using the `generate_date` function and save it to a CSV file.

#### Generating Sales Data
- Generate sales data by associating transactions with products, customers, and dates.
- Save the sales data to a CSV file.

## Loading modules and packages

In [1]:
from CLV_Analysis.DB.data_generator import generate_product
from CLV_Analysis.DB.data_generator import generate_customer
from CLV_Analysis.DB.data_generator import generate_transaction
from CLV_Analysis.DB.data_generator import generate_date
from CLV_Analysis.DB.data_generator import generate_sales
import pandas as pd
import random
import os

## Declaring Constants

In [2]:
NUMBER_OF_PRODUCTS=5000
NUMBER_OF_CUSTOMERS=3000
NUMBER_OF_TRANSACTIONS=4000

In [3]:
# Check if 'data_csv' folder exists, if not, create it
output_directory = 'data_csv'
if not os.path.exists(output_directory):
    os.makedirs(output_directory)

## Generating Customer Data

In [4]:
customer_data = [generate_customer(customer_id) for customer_id
                 in range(NUMBER_OF_CUSTOMERS)]

# Save customer data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'customer.csv')
pd.DataFrame(customer_data)#.to_csv(output_file_path, index=False)

,customer_id,customer_name,customer_surname,email,phone,country,city,address,zip_code,birthday,gender
0,0,Elizabeth,Thompson,nschmidt@example.net,230-268-5279,Netherlands Antilles,Lake Brian,27392 Gonzalez Drive Suite 960,55720,1965-09-03,Prefer Not To Say
1,1,Jamie,Martinez,perrytroy@example.org,211-430-7068,Maldives,Simmonsfurt,8199 Lisa Springs Suite 302,82212,1985-12-25,Prefer Not To Say
2,2,Ronald,Morgan,patrickheidi@example.org,+1-392-971-3585,Netherlands Antilles,Lake Adam,344 Charles Underpass,23805,2000-08-19,Other
3,3,Amy,Stone,lhuerta@example.com,+1-611-671-7561x75354,Malawi,Lake Thomasport,529 Carter Locks,47439,1928-10-31,Other
4,4,Ronald,Warner,steven31@example.org,001-712-770-1940,Norfolk Island,Blakeburgh,924 Michael Row,63699,1997-02-28,Prefer Not To Say
...,...,...,...,...,...,...,...,...,...,...,...
2995,2995,Bryan,Nelson,jwilliams@example.net,(625)556-1890,Cote d'Ivoire,West Timothyport,43511 Tracy Knoll,11039,1931-12-22,Female
2996,2996,Jordan,Snyder,waltonjeffrey@example.org,(535)496-3531,Brunei Darussalam,East Randall,74385 Vaughn Fort Apt. 440,82880,1974-10-12,Female
2997,2997,Ryan,Banks,rhonda94@example.net,+1-999-910-3216x5506,Oman,West Russell,2021 Erickson Shore Apt. 046,72871,1958-12-09,Female
2998,2998,Phillip,Moreno,vegakatie@example.net,+1-628-357-5649x47990,Iraq,Lake Nicholas,90613 Carolyn Radial,58691,1973-10-05,Male
2999,2999,Todd,Parker,djohnson@example.org,+1-839-922-3056,Burkina Faso,Daniellehaven,81910 Powell Highway Suite 650,08204,1981-02-01,Prefer Not To Say

## Generating Product Data

In [5]:
product_data = [generate_product(product_id) for product_id
                in range(NUMBER_OF_PRODUCTS)]
# Save product data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'product.csv')
pd.DataFrame(product_data)#.to_csv(output_file_path, index=False)

      product_id    SKU product_category     producer_country  price
0              0  B845B           Garden  Trinidad and Tobago  72.10
1              1  3CD46         Outdoors              Germany  59.18
2              2  9B906          Grocery           Luxembourg   6.73
3              3  BC9D0            Books               Monaco   7.54
4              4  EFBBC           Movies           Costa Rica  58.89
...          ...    ...              ...                  ...    ...
4995        4995  BB167      Electronics               Mexico  76.12
4996        4996  EBA10             Home            Indonesia  85.42
4997        4997  5A80D         Clothing                 Niue  42.30
4998        4998  B3858         Jewelery               Zambia  40.15
4999        4999  F68BD           Movies               Angola  28.21

[5000 rows x 5 columns]

## Generating Transaction Data

In [6]:
transaction_data = [generate_transaction(transaction_id) for transaction_id
                    in range(NUMBER_OF_TRANSACTIONS)] 
# Save transaction data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'transactions.csv')
pd.DataFrame(transaction_data)#.to_csv(output_file_path, index=False)

      transaction_id        date  payment_method  customer_id
0                  0  2010-03-05            Cash          418
1                  1  2016-09-05  Mobile Payment         1278
2                  2  2005-01-04           Check         2926
3                  3  2002-03-05      Debit Card         2836
4                  4  2005-02-28           Check         1896
...              ...         ...             ...          ...
3995            3995  2010-10-24     Credit Card         1757
3996            3996  2012-04-02            Cash         1154
3997            3997  2018-02-03     Credit Card         2316
3998            3998  2023-11-25     Credit Card         1560
3999            3999  2001-08-23  Mobile Payment         1227

[4000 rows x 4 columns]

## Generating Dates Data

In [7]:
from datetime import datetime

# Define the start and end dates as strings
start_date = "2000-01-01"
end_date = "2023-12-31"

# Convert the date strings to datetime objects
start_date_obj = datetime.strptime(start_date, "%Y-%m-%d")
end_date_obj = datetime.strptime(end_date, "%Y-%m-%d")

# Calculate the difference between the two dates
number_of_days = (end_date_obj - start_date_obj).days
number_of_days

8765

In [8]:
dates_data = [generate_date(date_id) for date_id in range(number_of_days+1)] 
# Save date data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'date.csv')
pd.DataFrame(dates_data)#.to_csv(output_file_path, index=False)

,date_id,date,month,month_name,year,quarter,day_of_month,day_of_year,day_of_week_number,day_of_week_name,week_of_year,week_of_month
0,0,2000-01-01,1,January,2000,1,1,1,6,Saturday,52,1
1,1,2000-01-02,1,January,2000,1,2,2,7,Sunday,52,1
2,2,2000-01-03,1,January,2000,1,3,3,1,Monday,1,1
3,3,2000-01-04,1,January,2000,1,4,4,2,Tuesday,1,1
4,4,2000-01-05,1,January,2000,1,5,5,3,Wednesday,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
8761,8761,2023-12-27,12,December,2023,4,27,361,3,Wednesday,52,4
8762,8762,2023-12-28,12,December,2023,4,28,362,4,Thursday,52,4
8763,8763,2023-12-29,12,December,2023,4,29,363,5,Friday,52,5
8764,8764,2023-12-30,12,December,2023,4,30,364,6,Saturday,52,5
8765,8765,2023-12-31,12,December,2023,4,31,365,7,Sunday,52,5

## Generating Sales Data

In [9]:
DateData = pd.DataFrame(dates_data)
TransData = pd.DataFrame(transaction_data)

DateData["date"] = pd.to_datetime(DateData["date"])
TransData["date"] = pd.to_datetime(TransData["date"])

In [10]:
# Create an array with numbers from 1 to 4000
original_array = list(range(0, NUMBER_OF_TRANSACTIONS))

# Create a new array with randomly duplicated elements
duplicated_array = []
for num in original_array:
    # Generate a random number between 1 and 5 (inclusive)
    duplicates = random.randint(1, 5)
    # Append the number to the new array 'duplicates' times
    duplicated_array.extend([num] * duplicates)

len(duplicated_array)

12091

In [11]:
# Save sales data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'sales.csv')

sales_data = [generate_sales() for i in range(len(duplicated_array))] 
sales_data = pd.DataFrame(sales_data)
sales_data["transaction_id"] = duplicated_array
sales_data = sales_data[['transaction_id', 'product_id', 'quantity']]
sales_data = sales_data.merge(TransData, on='transaction_id', how='left')
sales_data = sales_data.merge(DateData, on='date', how='left')
sales_data = sales_data[['transaction_id','product_id', 'customer_id', 'quantity', 'date_id']]
sales_data#.to_csv(output_file_path, index=False)

       transaction_id  product_id  customer_id  quantity  date_id
0                   0         221          418        18     3716
1                   0        1387          418        13     3716
2                   0        1545          418        17     3716
3                   1        3774         1278        13     6092
4                   1        4455         1278         9     6092
...               ...         ...          ...       ...      ...
12086            3999        1417         1227        12      600
12087            3999         475         1227         5      600
12088            3999         108         1227         2      600
12089            3999         763         1227        17      600
12090            3999        4393         1227        15      600

[12091 rows x 5 columns]